In [1]:
import numpy as np

In [2]:
import pandas as pd

In [15]:
data = np.random.randn(4, 3)

In [16]:
data

array([[ 0.94888949, -1.35552845,  3.070881  ],
       [-0.17952742,  0.81381184, -1.53308918],
       [ 0.49786617,  0.83423647, -0.61280431],
       [ 0.49245568, -2.560041  ,  2.11340799]])

In [17]:
data_frame = pd.DataFrame(data)

In [18]:
data_frame

          0         1         2
0  0.948889 -1.355528  3.070881
1 -0.179527  0.813812 -1.533089
2  0.497866  0.834236 -0.612804
3  0.492456 -2.560041  2.113408

In [19]:
type(data_frame)

pandas.core.frame.DataFrame

In [20]:
type(data_frame[1])

pandas.core.series.Series

In [59]:
fixed_frame = pd.DataFrame(data, index=["A", "B", "C", "D"], columns=["X", "Y", "Z"])

In [24]:
fixed_frame

          X         Y         Z
A  0.948889 -1.355528  3.070881
B -0.179527  0.813812 -1.533089
C  0.497866  0.834236 -0.612804
D  0.492456 -2.560041  2.113408

In [26]:
fixed_frame["Y"]

A   -1.355528
B    0.813812
C    0.834236
D   -2.560041
Name: Y, dtype: float64

In [27]:
fixed_frame[["X", "Y"]]

          X         Y
A  0.948889 -1.355528
B -0.179527  0.813812
C  0.497866  0.834236
D  0.492456 -2.560041

In [31]:
fixed_frame.loc["B"] # location

X   -0.179527
Y    0.813812
Z   -1.533089
Name: B, dtype: float64

In [33]:
fixed_frame.iloc[0] # Index location

X    0.948889
Y   -1.355528
Z    3.070881
Name: A, dtype: float64

In [34]:
fixed_frame["Extra"] = 10

In [35]:
fixed_frame

          X         Y         Z  Extra
A  0.948889 -1.355528  3.070881     10
B -0.179527  0.813812 -1.533089     10
C  0.497866  0.834236 -0.612804     10
D  0.492456 -2.560041  2.113408     10

In [37]:
fixed_frame.drop("Extra", axis=1)

          X         Y         Z
A  0.948889 -1.355528  3.070881
B -0.179527  0.813812 -1.533089
C  0.497866  0.834236 -0.612804
D  0.492456 -2.560041  2.113408

In [38]:
fixed_frame

          X         Y         Z  Extra
A  0.948889 -1.355528  3.070881     10
B -0.179527  0.813812 -1.533089     10
C  0.497866  0.834236 -0.612804     10
D  0.492456 -2.560041  2.113408     10

In [39]:
fixed_frame.drop("Extra", axis=1, inplace=True)

In [40]:
fixed_frame

          X         Y         Z
A  0.948889 -1.355528  3.070881
B -0.179527  0.813812 -1.533089
C  0.497866  0.834236 -0.612804
D  0.492456 -2.560041  2.113408

In [41]:
fixed_frame.loc["B"]["Y"]

np.float64(0.8138118384454911)

In [42]:
fixed_frame.loc["B","Y"]

np.float64(0.8138118384454911)

In [43]:
fixed_frame.loc["B","Y"] = 100

In [44]:
fixed_frame

          X           Y         Z
A  0.948889   -1.355528  3.070881
B -0.179527  100.000000 -1.533089
C  0.497866    0.834236 -0.612804
D  0.492456   -2.560041  2.113408

In [45]:
fixed_frame < 0

       X      Y      Z
A  False   True  False
B   True  False   True
C  False  False   True
D  False   True  False

In [46]:
fixed_frame [fixed_frame < 0]

          X         Y         Z
A       NaN -1.355528       NaN
B -0.179527       NaN -1.533089
C       NaN       NaN -0.612804
D       NaN -2.560041       NaN

In [47]:
fixed_frame [fixed_frame["Y"] < 0]

          X         Y         Z
A  0.948889 -1.355528  3.070881
D  0.492456 -2.560041  2.113408

In [48]:
reset_frame = fixed_frame.reset_index()

In [49]:
reset_frame

  index         X           Y         Z
0     A  0.948889   -1.355528  3.070881
1     B -0.179527  100.000000 -1.533089
2     C  0.497866    0.834236 -0.612804
3     D  0.492456   -2.560041  2.113408

In [60]:
new_indices = ["E", "F", "G", "H"]

In [61]:
fixed_frame["NewIndex"] = new_indices

In [62]:
fixed_frame

          X         Y         Z NewIndex
A  0.948889 -1.355528  3.070881        E
B -0.179527  0.813812 -1.533089        F
C  0.497866  0.834236 -0.612804        G
D  0.492456 -2.560041  2.113408        H

In [63]:
fixed_frame.set_index("NewIndex", inplace=True)

In [64]:
fixed_frame

                 X         Y         Z
NewIndex
E         0.948889 -1.355528  3.070881
F        -0.179527  0.813812 -1.533089
G         0.497866  0.834236 -0.612804
H         0.492456 -2.560041  2.113408

In [71]:
fixed_frame.loc["F"]

X   -0.179527
Y    0.813812
Z   -1.533089
Name: F, dtype: float64

In [72]:
fixed_frame["Y"]

NewIndex
E   -1.355528
F    0.813812
G    0.834236
H   -2.560041
Name: Y, dtype: float64

In [73]:
# multi index

In [74]:
first_index = ["Simpson", "Simpson", "Simpson", "South Park", "South Park", "South Park"]

In [75]:
inner_index = ["Homer", "Bart", "Marge", "Cartman", "Kenny", "Kyle"]

In [78]:
zipped_index = list(zip(first_index, inner_index))

In [79]:
zipped_index

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [80]:
zipped_index = pd.MultiIndex.from_tuples(zipped_index)

In [81]:
zipped_index

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [82]:
samples_values = np.ones((6, 2))

In [83]:
new_frame = pd.DataFrame(samples_values, index=zipped_index, columns=("A","B"))

In [84]:
new_frame

                      A    B
Simpson    Homer    1.0  1.0
           Bart     1.0  1.0
           Marge    1.0  1.0
South Park Cartman  1.0  1.0
           Kenny    1.0  1.0
           Kyle     1.0  1.0

In [85]:
new_frame.loc["Simpson"]

         A    B
Homer  1.0  1.0
Bart   1.0  1.0
Marge  1.0  1.0

In [86]:
new_frame["A"]

Simpson     Homer      1.0
            Bart       1.0
            Marge      1.0
South Park  Cartman    1.0
            Kenny      1.0
            Kyle       1.0
Name: A, dtype: float64

In [88]:
new_frame.loc["Simpson"].loc["Homer"]

A    1.0
B    1.0
Name: Homer, dtype: float64